Revit 2027 API
ParameterTypeId.SteelElemWeight Property
 "Weight"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemWeight { get; }
Public Shared ReadOnly Property SteelElemWeight As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemWeight {
	ForgeTypeId^ get ();
}
static member SteelElemWeight : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace